/*
    Αυτό το σενάριο κώδικα γράφτηκε με την παρακάτω λογική :
    Όταν ο χρήστης πατήσει πάνω στον σύνδεσμο ενός έργου, θα πρέπει να τον μεταφέρει σε μια νέα καρτέλα όπου σε αυτή
    θα δει το έγγραφο αναφοράς (PDF) του έργου. Όμως για να γίνει αυτό ομαλά θα πρέπει :
        1) Όσο μαζεύονται οι επιμέρους πληροφορίες του εγγράφου αναφοράς και έπειτα μεταγλωττίζεται ο LaTeX κώδικας,
           ο χρήστης να ενημερώνετε καταλλήλως ώστε να καταλαβαίνει πως κάτι γίνεται και θα χρειαστεί ένα μικρό διάστημα
           αναμονής.
        2) Να γίνει έλεγχος για το αν πράγματι δημιουργήθηκε το PDF έγγραφο ή όχι και αναλόγως έπειτα να μεταφέρει τον
           χρήστη στις δύο παρακάτω περιπτώσεις χρήσης :
            α) Προβολή του εγγράφου.
            β) Εμφάνιση μηνύματος σφάλματος.

    Οπότε το παρακάτω σενάριο κώδικα αναλαμβάνει όλη αυτή την παραπάνω διαδικασία.
    Συγκεκριμένα, μόλις διαπιστωθεί πως πάτησε ο χρήστης πάνω σε ένα σύνδεσμο :
        1) Διακόπτετε η διαδικασία μετάβασης στην νέα καρτέλα
           ( απαιτείται ένας μικρός χρόνο μέχρι να δημιουργηθεί το PDF )
        2) Ενημερώνεται ο χρήστης πως δημιουργείται το έγγραφο.
        3) Στέλνεται ένα *ασύγχρονο μήνυμα* στην διαδικασία που είναι αρμόδια ώστε να δημιουργήσει το PDF έγγραφο.
        4) Ελέγχεται το επιστρεφόμενο αποτέλεσμα της υπεύθυνης για την παραγωγή του PDF διαδικασίας και αναλόγως,
        ο χρήστης μεταβιβάζεται σε μια νέα καρτέλα όπου :
            α) θα δει το παραγόμενο για το έργο που επέλεξε, PDF
            β) θα δει ένα μήνυμα σφάλματος.
*/

$(document).ready(function()
{

    $('.project a').click(function ( event )
    {

        event.preventDefault(); // Stop to open new tab.

        var project_id = $(this).attr('href').split('/')[4].split('.')[0]; // Get project id.
        var new_tab = $(this).attr("href"); // Get static folder path to file.


        // Ώστε να δείξει πως κάτι φορτώνει...
        $('body').loading(
        {
            stoppable: true
        });


        $.ajax(
        {
            url: '/ajax/create_pdf/' + project_id ,
            data:'',
            statusCode:
                {
                    200: function() // Δημιουργήθηκε επιτυχώς το PDF ( success ).
                        {
                            $('body').loading('stop'); // Stop "Loading" script.
                            window.open('/static/report/download/' + project_id + '.pdf','_blank');
                        },
                    504: function() // Δεν μπόρεσε για κάποιον λόγο να δημιουργήσει την σελίδα.
                        {
                            $('body').loading('stop'); // Stop "Loading" script.
                            window.open('/pdf_error/' + window.location.pathname.split('/')[1] +
                                '/' +
                                window.location.pathname.split('/')[2] + '/' + project_id + '/','_blank');
                        }
                }

        });



    }
    );


});
